
#PART_2_PROJECT

'''祝贺你！你现在已对 Python 有了足够的认识，可以开始开发有意思的交互式项目了。通过
动手开发项目，可学到新技能，并更深入地理解第一部分介绍的概念。
第二部分包含三个不同类型的项目，你可以选择完成其中的任何项目或全部项目，完成这
些项目的顺序无关紧要。下面简要地描述每个项目，帮助你决定首先去完成哪个项目。
外星人入侵 ：使用 Python 开发游戏
在项目“外星人入侵”（第 12~14 章）中，你将使用 Pygame 包来开发一款 2D 游戏，它在
玩家每消灭一群向下移动的外星人后，都将玩家提高一个等级 ；而等级越高，游戏的节奏越快，
难度越大。完成这个项目后，你将获得自己动手使用 Pygame 开发 2D 游戏所需的技能。
数据可视化
“数据可视化”项目始于第 15 章，在这一章中，你将学习如何使用 matplotlib 和 Pygal 来生
成数据，以及根据这些数据创建实用而漂亮的图表。第 16 章介绍如何从网上获取数据，并将它
们提供给可视化包以创建天气图和世界人口地图。最后，第 17 章介绍如何编写自动下载数据并
对其进行可视化的程序。学习可视化让你可以探索数据挖掘领域，这是当前在全球都非常吃香
的技能。
Web 应用程序
在“Web 应用程序”项目（第 18~20 章）中，你将使用 Django 包来创建一个简单的 Web
应用程序，它让用户能够记录任意多个一直在学习的主题。用户将通过指定用户名和密码来创
建账户，输入主题，并编写条目来记录学习的内容。你还将学习如何部署应用程序，让世界上
的任何人都能够访问它。
完成这个项目后，你将能够自己动手创建简单的 Web 应用程序，并能够深入学习其他有关
如何使用 Django 开发应用程序的资料。'''